           77 WRK-VENDAS    PIC 9(06)V99 VALUE ZEROS.   
           77 WRK-QT        PIC 9(32)    VALUE 1.
           77 WRK-TOTAL     PIC 9(08)V99 VALUE ZEROS.
           