       IDENTIFICATION DIVISION.
           PROGRAM-ID. LERCPF.
       ENVIRONMENT DIVISION.
           CONFIGURATION SECTION.
               SPECIAL-NAMES.
                   DECIMAL-POINT IS COMMA.
       DATA DIVISION.
           WORKING-STORAGE SECTION.
               77 WRK-CPF PIC 9(11) VALUE ZEROS.
               77 WRK-CPF-ED PIC 999.999.999/99.
       PROCEDURE DIVISION.
           ACCEPT WRK-CPF FROM CONSOLE
           MOVE WRK-CPF TO WRK-CPF-ED
           DISPLAY WRK-CPF-ED
           STOP RUN.
